<template>
  <el-dialog class="dialog" :title="title" :visible.sync="visible" @close="$emit('update:visible', false)">
    <div class="dialog-title">布局说明:</div>
    <div class="dialog-main">
      <pre>
1-横                                2-半半
+----------------+----------------+ +----------------+----------------+
|                                 | |                |                |
|              横横               | |   半半-半1     |   半半-半2     |
|                                 | |                |                |
+----------------+----------------+ +----------------+----------------+

3-横横                             <!-- 4-横半半                            5-半半横-->
+----------------+----------------+<!-- +----------------+----------------+ +----------------+----------------+-->
|                                 |<!-- |                                 | |                |                |-->
|            横横-横1             |<!-- |            横半半-横1           | |   半半横-半1   |   半半横-半2   |-->
|                                 |<!-- |                                 | |                |                |-->
+----------------+----------------+<!-- +----------------+----------------+ +----------------+----------------+-->
|                                 |<!-- |                |                | |                                 |-->
|            横横-横2             |<!-- |   横半半-半1   |   横半半-半2   | |            半半横-横1           |-->
|                                 |<!-- |                |                | |                                 |-->
+----------------+----------------+<!-- +----------------+----------------+ +----------------+----------------+-->

6-竖竖                              7-竖半半                            <!--8-半半竖-->
+----------------+----------------+ +----------------+----------------+ <!--+----------------+----------------+-->
|                |                | |                |                | <!--|                |                |-->
|                |                | |                |   竖半半-半1   | <!--|   半半竖-半1   |                |-->
|                |                | |                |                | <!--|                |                |-->
|   竖竖-竖1     +   竖竖-竖2     + |   竖半半-竖1   +----------------+ <!--|----------------+   半半竖-竖1   +-->
|                |                | |                |                | <!--|                |                |-->
|                |                | |                |   竖半半-半2   | <!--|   半半竖-半2   |                |-->
|                |                | |                |                | <!--|                |                |-->
+----------------+----------------+ +----------------+----------------+ <!--+----------------+----------------+-->

9-半半半半
+----------------+----------------+
|                |                |
|   半半半半-半1 |   半半半半-半2 |
|                |                |
+----------------+----------------+
|                |                |
|   半半半半-半3 |   半半半半-半4 |
|                |                |
+----------------+----------------+

      </pre>
    </div>
    <div slot="footer" class="dialog-footer">
      <el-button @click="$emit('update:visible', false)">关闭</el-button>
    </div>
  </el-dialog>
</template>

<script>
export default {
  props: {
    visible: {
      type: Boolean,
      required: true
    }
  },
  data () {
    return {
      title: '帮助'
    }
  },
  methods: {

  }
}
</script>

<style lang="scss" scoped>
.dialog {
  margin-bottom: 30px;
  .dialog-title{
    color:red;
    margin: 0;
  }
  .dialog-main{
    width: 46vw;
    height: 460px;
    overflow: auto;
    border: 2px solid #999;
    transform: scale(0.9);
    padding: 10px;
    pre{
      font-weight: 700;
    }
  }
}
</style>
